# A Friends DataFrame

### Instructions

#### Part 1: Initial Setup

1. Ask each classmate in the breakout room the following:
    * Their name.
    * Their location.
    * How many years of software experience they have.
    * One technology they have experience with.

2. Import the required libraries and dependencies into your Jupyter Notebook.

#### Part 2: `Series` to `DataFrame`

1. Create three dictionaries for the data collected.

    * The keys for each dictionary are the names.
    * The values for the first dictionary are the locations.
    * The values for the second dictionary are the years of experience.
    * The values for the third dictionary are the technology used.

2. Convert each dictionary into a Pandas `Series`, storing each in its own variable.

3. Create a Pandas `DataFrame` using the three `Series` as data.

4. Transpose the resulting `DataFrame`.

#### Part 3: `Dictionary` to `DataFrame`

1. Create a single `dictionary` where the keys are your classmates' names and the other values are stored in a list.

  For example:

  ```python
  my_classmates = {
    "Anna": ["London",1,"Java"],
    "Mohammad" : ["Chicago",0,"Microsoft Office"],
  }
  ```

2. Create a Pandas DataFrame, using the my_classmates dictionary as the data. **Hint:** Use the `index` parameter and label the column names with ["City", "Software Experience", "Technologies Used"].

3. Transpose the DataFrame.

#### Part 4: Manipulate the `DataFrame`

1. View the data in the `DataFrame`'s City column.

2. Using the `mean` method, calculate the average years of software experience of the group.

3. For one of your classmates, increase their years of software experience by 1 year.

Be prepared to share some of your solutions with the class when you return from the breakout room.

# Part 1: Initial Setup

## Ask each classmate in the breakout room the following:

* Their name.
* Their location. 
* How many years of software experience they have.
* One technology they have experience with. 

## Import the required libraries and dependencies.

In [70]:
# Import the Pandas library
import pandas as pd

# Part 2: `Series` to `DataFrame`

## Create three dictionaries for the data collected from your classmates.

* The keys for each dictionary are the names.
* The values for the first dictionary are the locations.
* The values for the second dictionary are the years of experience.
* The values for the third dictionary are the technology used.

In [71]:
# Create three dictionaries with classmates' names as keys, location, years and tech as values.
# YOUR CODE HERE
classmate_city={
    "Israel" : "San_Diego",
    "Dominik" : "Newport",
    "Christina" : "Belmont"
    }

# YOUR CODE HERE
classmate_years={
    "Israel":0,
    "Dominik":1,
    "Christina":2
}

# YOUR CODE HERE
classmate_tech={
    "Israel":"python",
    "Dominik":"C++",
    "Christina":"java"
}

## Convert each dictionary into a Pandas Series, storing each in its own variable.

In [72]:
# Create a series from each dictionary
series_of_city = pd.Series(classmate_city, name="city")
series_of_years = pd.Series(classmate_years, name ="years")
series_of_tech = pd.Series(classmate_tech, name = "Tech")

# Preview one of the Series
series_of_tech

Israel       python
Dominik         C++
Christina      java
Name: Tech, dtype: object

## Create a Pandas `DataFrame` using the three `Series` as data

In [73]:
# Create DataFrame from the three Series
# Hint: Pass them as a list to the data parameter
series_to_dataframe = pd.DataFrame([classmate_city, classmate_years, classmate_tech])

# View the resulting DataFrame
series_to_dataframe

      Israel  Dominik Christina
0  San_Diego  Newport   Belmont
1          0        1         2
2     python      C++      java

## Transpose the resulting `DataFrame`.

In [74]:
# Transpose DataFrame 
series_to_dataframe = series_to_dataframe.T

# View the transposed DataFrame
series_to_dataframe

                   0  1       2
Israel     San_Diego  0  python
Dominik      Newport  1     C++
Christina    Belmont  2    java

# Part 3: `Dictionary` to `DataFrame`

## Create a single `dictionary` containing the data previously collected from your classmates.

* The keys for the dictionary are your classmates' names.
* The values for the dictionary are the remaining data in list format.
* For example:


```python
my_classmates = {
  "Anna": ["London",1,"Java"],
  "Mohammad" : ["Chicago",0,"Microsoft Office"],
}
```

In [75]:
# Create Dictionary
my_classmates = {
  "Israel": ["San Diego",1,"python"],
  "Dominik" : ["Newport",1,"C++"],
  "Christina" : ["Belmont",2,"java"],
  
}

## Create a Pandas `DataFrame` using the my_classmates dictionary as the data.

In [76]:
# Create DataFrame from the my_classmates dictionary
# Hint - Use the `index` parameter and label the 
# column names with ["City", "Software Experience", "Technologies Used"]
my_classmates_df = pd.DataFrame(my_classmates)


# View the resulting DataFrame
my_classmates_df

      Israel  Dominik Christina
0  San Diego  Newport   Belmont
1          1        1         2
2     python      C++      java

## Transpose the `DataFrame`.

In [77]:
# Transpose DataFrame 
my_classmates_df = my_classmates_df.T

# View the transposed DataFrame
my_classmates_df

                   0  1       2
Israel     San Diego  1  python
Dominik      Newport  1     C++
Christina    Belmont  2    java

In [78]:
# Rename the columns
my_classmates_df = my_classmates_df.rename(columns= {0: "City", 1: "Software experience", 2: "Technologies"})
# View the DataFrame
my_classmates_df

                City Software experience Technologies
Israel     San Diego                   1       python
Dominik      Newport                   1          C++
Christina    Belmont                   2         java

In [79]:
# Rename the axis(1)
my_classmates_df = my_classmates_df.rename_axis("Name", axis=1) 
my_classmates_df

Name            City Software experience Technologies
Israel     San Diego                   1       python
Dominik      Newport                   1          C++
Christina    Belmont                   2         java

# Part 4: Manipulate the `DataFrame`

## View the data in the `DataFrame`'s 'City' column.

In [83]:
# View the entries in the DataFrame's "City" column
#print(my_classmates_df["City"])
my_classmates_df["City"]

Israel       San Diego
Dominik        Newport
Christina      Belmont
Name: City, dtype: object

## Using the `mean()` method, calculate the average years of software experience of the group.

In [88]:
# Calculate mean value of the group's software experience
my_classmates_df["Software experience"].mean()

1.3333333333333333

## For one of your classmates, increase their years of software experience by 1 year.

In [90]:
# For one of your classmates, increase their years of software experience by 1 year. 
my_classmates_df["Software experience"][0]=2
# Confirm that the change has been made by viewing the DataFrame
my_classmates_df

Name            City Software experience Technologies
Israel     San Diego                   2       python
Dominik      Newport                   1          C++
Christina    Belmont                   2         java